{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "gpt2-medium",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "transformer.h.13.mlp.c_proj",
    "transformer.h.14.mlp.c_proj",
    "transformer.h.12.attn.c_attn",
    "transformer.h.16.mlp.c_proj",
    "transformer.h.12.mlp.c_fc",
    "transformer.h.16.mlp.c_fc",
    "transformer.h.16.attn.c_proj",
    "transformer.h.17.mlp.c_fc",
    "transformer.h.15.mlp.c_proj",
    "transformer.h.13.attn.c_attn",
    "transformer.h.14.mlp.c_fc",
    "transformer.h.15.attn.c_attn",
    "transformer.h.13.attn.c_proj",
    "transformer.h.17.mlp.c_proj",
    "transformer.h.17.attn.c_attn",
    "transformer.h.14.attn.c_attn",
    "transformer.h.17.attn.c_proj",
    "transformer.h.13.mlp.c_fc",
    "transformer.h.14.attn.c_proj",
    "transformer.h.16.attn.c_attn",
    "transformer.h.12.attn.c_proj",
    "transformer.h.15.mlp.c_fc",
    "transformer.h.15.attn.c_proj",
    "transformer.h.12.mlp.c_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}