{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "gpt2-medium",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 38,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 19,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "transformer.h.16.mlp.c_fc",
    "transformer.h.9.mlp.c_fc",
    "transformer.h.8.mlp.c_proj",
    "transformer.h.0.mlp.c_proj",
    "transformer.h.10.mlp.c_proj",
    "transformer.h.8.mlp.c_fc",
    "transformer.h.18.mlp.c_fc",
    "transformer.h.10.mlp.c_fc",
    "transformer.h.20.mlp.c_fc",
    "transformer.h.14.mlp.c_fc",
    "transformer.h.9.mlp.c_proj",
    "transformer.h.7.mlp.c_fc",
    "transformer.h.17.mlp.c_fc",
    "transformer.h.3.mlp.c_proj",
    "transformer.h.6.mlp.c_proj",
    "transformer.h.7.mlp.c_proj",
    "transformer.h.11.mlp.c_proj",
    "transformer.h.14.mlp.c_proj",
    "transformer.h.13.mlp.c_fc",
    "transformer.h.21.mlp.c_fc",
    "transformer.h.19.mlp.c_fc",
    "transformer.h.4.mlp.c_proj",
    "transformer.h.22.mlp.c_fc",
    "transformer.h.5.mlp.c_proj",
    "transformer.h.11.mlp.c_fc",
    "transformer.h.15.mlp.c_fc",
    "transformer.h.6.mlp.c_fc",
    "transformer.h.2.mlp.c_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}